// Задача 29: Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.
//Console.WriteLine("Hello, World!");
int[] N = new int[5] {1, 2, 5, 7, 19};
{
    Console.Write(N);
}